{
  "data": [
    {
      "id": 1,
      "title": "React",
      "subTitle": "React — это декларативная, эффективная и гибкая JavaScript-библиотека для создания пользовательских интерфейсов. Она позволяет вам собирать сложный UI из маленьких изолированных кусочков кода, называемых «компонентами».",
      "description": "React — это JavaScript-библиотека для разработки пользовательского интерфейса. Чтобы составить первое впечатление о React, зайдите на главную страницу или во введение. React 18 was years in the making, and with it brought valuable lessons for the React team. Its release was the result of many years of research and exploring many paths. Some of those paths were successful; many more were dead-ends that led to new insights. One lesson we’ve learned is that it’s frustrating for the community to wait for new features without having insight into these paths that we're exploring."
    },
    {
      "id": 2,
      "title": "Next",
      "subTitle": "Next.js предоставляет вам наилучшие возможности разработчика со всеми функциями, необходимыми для производства: гибридный статический и серверный рендеринг, поддержка TypeScript, интеллектуальное объединение, предварительная выборка маршрута и многое другое. Конфигурация не требуется.",
      "description": "Next.js предоставляет вам наилучшие возможности разработчика со всеми функциями, необходимыми для производства: гибридный статический и серверный рендеринг, поддержка TypeScript, интеллектуальное объединение, предварительная выборка маршрута и многое другое. Конфигурация не требуется. Next.js это платформа React Framework, которая предоставляет вам строительные блоки для создания веб-приложений. Под структурой мы подразумеваем Next.js обрабатывает инструменты и конфигурацию, необходимые для React, а также предоставляет дополнительную структуру, функции и оптимизации для вашего приложения."
    },
    {
      "id": 3,
      "title": "TypeScript",
      "subTitle": "TypeScript добавляет дополнительный синтаксис в JavaScript для поддержки более тесной интеграции с вашим редактором. Ловите ошибки на ранней стадии в вашем редакторе.",
      "description": " TypeScript добавляет дополнительный синтаксис в JavaScript для поддержки более тесной интеграции с вашим редактором. Ловите ошибки на ранней стадии в вашем редакторе. Код TypeScript преобразуется в JavaScript, который запускается везде, где запускается JavaScript: в браузере, на Node.js или Deno и в ваших приложениях. TypeScript понимает JavaScript и использует вывод типов, чтобы предоставить вам отличный инструментарий без дополнительного кода. TypeScript проверяет программу на наличие ошибок перед выполнением и делает это на основе типов значений, это статическая проверка типов. Например, в последнем примере выше ошибка из-за типа obj. Вот ошибка, обнаруженная TypeScript:"
    },
    {
      "id": 4,
      "title": "JavaScript",
      "subTitle": "JavaScript® (часто просто JS) — это легковесный, интерпретируемый или JIT-компилируемый, объектно-ориентированный язык с функциями первого класса.",
      "description": "JavaScript (также известный как ECMAScript) начал свою жизнь как простой язык сценариев для браузеров. В то время, когда он был изобретен, ожидалось, что он будет использоваться для коротких фрагментов кода, встроенных в веб—страницу - написание более нескольких десятков строк кода было бы несколько необычным. Из-за этого ранние веб-браузеры выполняли такой код довольно медленно. Однако со временем JS становился все более популярным, и веб-разработчики начали использовать его для создания интерактивных приложений. Разработчики веб-браузеров отреагировали на это возросшее использование JS, оптимизировав свои механизмы выполнения (динамическая компиляция) и расширив возможности (добавление API), что, в свою очередь, заставило веб-разработчиков использовать его еще больше. На современных веб-сайтах в вашем браузере часто запускаются приложения, которые занимают сотни тысяч строк кода. Это длительный и постепенный рост “сети”, начинающийся как простая сеть статических страниц и развивающийся в платформу для разнообразных приложений."
    }
  ]
}
